<a href="https://colab.research.google.com/github/EvgeniiSopov/PrIS_02/blob/main/PRIS_03_3_2021.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Мини проект для работы с гит и гитхаб.

<h2> Exploratory data analysis (EDA) </h2>

<h2> Разветочный (исследовательский) анализ данных </h2>

<img src="http://sharpsightlabs.com/wp-content/uploads/2016/05/1_data-analysis-for-ML_how-we-use-dataAnalysis_2016-05-16.png">

# import packages

In [2]:
import pandas as pd
import numpy as np
from IPython.display import display

# import data

The study of classification of types of glass was motivated by criminological investigation. At the scene of the crime, the glass left can be used as evidence ... if it is correctly identified!

Attributes are:
1. Id number: 1 to 214
2. RI: refractive index
3. Na: Sodium 
4. Mg: Magnesium
5. Al: Aluminum
6. Si: Silicon
7. K: Potassium
8. Ca: Calcium
9. Ba: Barium
10. Fe: Iron
11. Type of glass

Type of glass:
1. building_windows_float_processed
2. building_windows_non_float_processed
3. vehicle_windows_float_processed
4. vehicle_windows_non_float_processed (none in this database)
5. containers
6. tableware
7. headlamps

In [3]:
data = pd.read_csv("http://archive.ics.uci.edu/ml/machine-learning-databases/glass/glass.data", 
                   header=None)
data.head(3)

   0        1      2     3     4      5     6     7    8    9   10
0   1  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0   1
1   2  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0   1
2   3  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0   1

In [4]:
names = ["Id","RI", "Na", "Mg", "Al", "Si", "K", "Ca", "Ba", "Fe", "Class"]
data.columns = names
data = data.drop(columns=['Id'])
data.head(3)

        RI     Na    Mg    Al     Si     K    Ca   Ba   Fe  Class
0  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0      1
1  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0      1
2  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0      1

In [5]:
data['Class'].replace({1:"building_float", 
                       2:"building_non_float", 
                       3:"vehicle_float",
                       4:"vehicle_non_float", 
                       5:"containers", 
                       6:"tableware",
                       7:"headlamps"}, inplace=True)
data['Class'].value_counts()

building_non_float    76
building_float        70
headlamps             29
vehicle_float         17
containers            13
tableware              9
Name: Class, dtype: int64

In [7]:
for col in data.columns:
    fr = np.random.randint(5,10)/100
    data.loc[data.sample(frac=fr).index, col] = np.nan

# Data Vizualization

In [12]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214 entries, 0 to 213
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RI      199 non-null    float64
 1   Na      203 non-null    float64
 2   Mg      203 non-null    float64
 3   Al      203 non-null    float64
 4   Si      203 non-null    float64
 5   K       199 non-null    float64
 6   Ca      199 non-null    float64
 7   Ba      195 non-null    float64
 8   Fe      199 non-null    float64
 9   Class   203 non-null    object
dtypes: float64(9), object(1)
memory usage: 16.8+ KB

In [13]:
data.describe()

               RI          Na          Mg  ...          Ca          Ba          Fe
count  199.000000  203.000000  203.000000  ...  199.000000  195.000000  199.000000
mean     1.518435   13.390197    2.680246  ...    8.909497    0.158000    0.055628
std      0.003056    0.815409    1.446289  ...    1.378047    0.456334    0.096465
min      1.511150   10.730000    0.000000  ...    5.430000    0.000000    0.000000
25%      1.516540   12.885000    1.985000  ...    8.225000    0.000000    0.000000
50%      1.517680   13.300000    3.480000  ...    8.590000    0.000000    0.000000
75%      1.519155   13.805000    3.605000  ...    9.140000    0.000000    0.095000
max      1.533930   17.380000    4.490000  ...   16.190000    2.880000    0.510000

[8 rows x 9 columns]

In [18]:
print("===========================")
display(data['Class'].describe())
print("===========================")
display(data['Class'].value_counts())

===========================

count                    203
unique                     6
top       building_non_float
freq                      71
Name: Class, dtype: object

===========================

building_non_float    71
building_float        68
headlamps             28
vehicle_float         16
containers            12
tableware              8
Name: Class, dtype: int64